ZGHVER/stm32f401/ds_ucos/User/BSP/OLED/oled.c
#include "oled.h"
#include "stdlib.h"
#include "oledfont.h"
#include "stm32f4xx_rcc.h"
#include "stm32f4xx_gpio.h"

u8 OLED_GRAM[128][8];

void OLED_Refresh_Gram(void)
{
	u8 i, n;
	for (i = 0; i < 8; i++)
	{
		OLED_WR_Byte(0xb0 + i, OLED_CMD);
		OLED_WR_Byte(0x00, OLED_CMD);
		OLED_WR_Byte(0x10, OLED_CMD);
		for (n = 0; n < 128; n++)
			OLED_WR_Byte(OLED_GRAM[n][i], OLED_DATA);
	}
}

#if OLED_IIC 

#define high 1
#define low 0

uint8_t i = 0x55;
void delaydd(){
	while(i--){
	}
   i = 0x55;
}

void IIC_Start(){
   SCL = high;
   delaydd();
   SDA = high;
   delaydd();
   SDA = low;
   SCL = low;
}

void IIC_Stop(){
   SDA = low;
   delaydd();
   SCL = high;
   delaydd();
   delaydd();
   SDA = high;
}

uint8_t Write_IIC_Byte(unsigned char IIC_Byte){
	unsigned char i;
	for(i=0;i<8;i++)		
	{
		if(IIC_Byte & 0x80)		//1?0?
		SDA=high;
		else
		SDA=low;
		delaydd();
		SCL=high;
		delaydd();
		delaydd();
		SCL=low;
		delaydd();
		IIC_Byte<<=1;			//loop
	}
	 SDA = high;		                //ÊÍ·ÅIIC SDA×ÜÏßÎªÖ÷Æ÷¼þ½ÓÊÕ´ÓÆ÷¼þ²úÉúÓ¦´ðÐÅºÅ	
	delaydd();
	delaydd();
	SCL = high;                     //µÚ9¸öÊ±ÖÓÖÜÆÚ
	delaydd();
	delaydd();
	uint8_t Ack_Bit  = SDA;		            //¶ÁÈ¡Ó¦´ðÐÅºÅ
	SCL = low;
	return Ack_Bit;	
}  

void Write_IIC_Command(unsigned char IIC_Command){
   IIC_Start();
   Write_IIC_Byte(0x78);            //Slave address,SA0=0
   Write_IIC_Byte(0x00);			//write command
   Write_IIC_Byte(IIC_Command); 
   IIC_Stop();
}

void Write_IIC_Data(unsigned char IIC_Data){
   IIC_Start();
   Write_IIC_Byte(0x78);			
   Write_IIC_Byte(0x40);			//write data
   Write_IIC_Byte(IIC_Data);
   IIC_Stop(); 
}

void OLED_WR_Byte(u8 dat, u8 cmd){
	if(cmd == OLED_CMD)
		Write_IIC_Command(dat);
	else if(cmd == OLED_DATA)	
		Write_IIC_Data(dat);
}
#else

void OLED_WR_Byte(u8 dat, u8 cmd){
	u8 i;
	OLED_RS = cmd; //Ð´ï¿½ï¿½ï¿½ï¿½
	for (i = 0; i < 8; i++)
	{
		OLED_SCLK = 0;
		if (dat & 0x80)
			OLED_SDIN = 1;
		else
			OLED_SDIN = 0;
		OLED_SCLK = 1;
		dat <<= 1;
	}
	OLED_RS = 1;
}

#endif

void OLED_Display_On(void)
{
	OLED_WR_Byte(0X8D, OLED_CMD);
	OLED_WR_Byte(0X14, OLED_CMD);
	OLED_WR_Byte(0XAF, OLED_CMD);
}

void OLED_Display_Off(void)
{
	OLED_WR_Byte(0X8D, OLED_CMD);
	OLED_WR_Byte(0X10, OLED_CMD);
	OLED_WR_Byte(0XAE, OLED_CMD);
}

void OLED_Clear(void)
{
	u8 i, n;
	for (i = 0; i < 8; i++)
		for (n = 0; n < 128; n++)
			OLED_GRAM[n][i] = 0X00;
}

void OLED_DrawPoint(u8 x, u8 y, u8 t)
{
	u8 pos, bx, temp = 0;
	if (x > 127 || y > 63)
		return;
	pos = 7 - y / 8;
	bx = y % 8;
	temp = 1 << (7 - bx);
	if (t)
		OLED_GRAM[x][pos] |= temp;
	else
		OLED_GRAM[x][pos] &= ~temp;
}

void OLED_Fill(u8 x1, u8 y1, u8 x2, u8 y2, u8 dot)
{
	u8 x, y;
	for (x = x1; x <= x2; x++)
	{
		for (y = y1; y <= y2; y++)
			OLED_DrawPoint(x, y, dot);
	}
	OLED_Refresh_Gram();
}

void OLED_ShowChar(u8 x, u8 y, u8 chr, u8 size, u8 mode)
{
	u8 temp, t, t1;
	u8 y0 = y;
	u8 csize = (size / 8 + ((size % 8) ? 1 : 0)) * (size / 2);
	chr = chr - ' ';
	for (t = 0; t < csize; t++)
	{
		if (size == 12)
			temp = asc2_1206[chr][t];
		else if (size == 16)
			temp = asc2_1608[chr][t];
		else if (size == 24)
			temp = asc2_2412[chr][t];
		else
			return;
		for (t1 = 0; t1 < 8; t1++)
		{
			if (temp & 0x80)
				OLED_DrawPoint(x, y, mode);
			else
				OLED_DrawPoint(x, y, !mode);
			temp <<= 1;
			y++;
			if ((y - y0) == size)
			{
				y = y0;
				x++;
				break;
			}
		}
	}
}
u32 mypow(u8 m, u8 n)
{
	u32 result = 1;
	while (n--)
		result *= m;
	return result;
}

void OLED_ShowNum(u8 x, u8 y, u32 num, u8 len, u8 size)
{
	u8 t, temp;
	u8 enshow = 0;
	for (t = 0; t < len; t++)
	{
		temp = (num / mypow(10, len - t - 1)) % 10;
		if (enshow == 0 && t < (len - 1))
		{
			if (temp == 0)
			{
				OLED_ShowChar(x + (size / 2) * t, y, ' ', size, 1);
				continue;
			}
			else
				enshow = 1;
		}
		OLED_ShowChar(x + (size / 2) * t, y, temp + '0', size, 1);
	}
}

void OLED_ShowString(u8 x, u8 y, const u8 *p, u8 size)
{
	while ((*p <= '~') && (*p >= ' ')) //ï¿½Ð¶ï¿½ï¿½Ç²ï¿½ï¿½Ç·Ç·ï¿½ï¿½Ö·ï¿½!
	{
		if (x > (128 - (size / 2)))
		{
			x = 0;
			y += size;
		}
		if (y > (64 - size))
		{
			y = x = 0;
			OLED_Clear();
		}
		OLED_ShowChar(x, y, *p, size, 1);
		x += size / 2;
		p++;
	}
}


void delayt(uint16_t de){
	while(de--);
}

void OLED_Init(void)
{
	//c5 b5 14 13
	#if OLED_IIC

	GPIO_InitTypeDef ioC;
	ioC.GPIO_Pin = GPIO_Pin_15;
	ioC.GPIO_Mode = GPIO_Mode_OUT;
	ioC.GPIO_OType = GPIO_OType_PP;
	ioC.GPIO_PuPd = GPIO_PuPd_UP;
	ioC.GPIO_Speed = GPIO_Speed_50MHz;
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOC, ENABLE);
	GPIO_Init(GPIOC, &ioC);
	GPIO_Init(GPIOB, &ioC);

	OLED_WR_Byte(0xae, OLED_CMD);
	OLED_WR_Byte(0x20, OLED_CMD);
	OLED_WR_Byte(0x10, OLED_CMD);
	OLED_WR_Byte(0xAE, OLED_CMD);
	OLED_WR_Byte(0xb0, OLED_CMD);
	OLED_WR_Byte(0xc8, OLED_CMD);
	OLED_WR_Byte(0x00, OLED_CMD);
	OLED_WR_Byte(0x10, OLED_CMD);
	OLED_WR_Byte(0x40, OLED_CMD);
	OLED_WR_Byte(0x81, OLED_CMD);
	OLED_WR_Byte(0x7f, OLED_CMD);
	OLED_WR_Byte(0xa1, OLED_CMD);
	OLED_WR_Byte(0xa6, OLED_CMD);
	OLED_WR_Byte(0xa8, OLED_CMD);
	OLED_WR_Byte(0x3f, OLED_CMD);
	OLED_WR_Byte(0xa4, OLED_CMD);
	OLED_WR_Byte(0xd3, OLED_CMD);
	OLED_WR_Byte(0x00, OLED_CMD);
	OLED_WR_Byte(0xd5, OLED_CMD);
	OLED_WR_Byte(0xf0, OLED_CMD);
	OLED_WR_Byte(0xd9, OLED_CMD);//0xae 0x20 0x10 0xb0 0xc8 0x00 0x10 0x40
	// 0x81 0x7f 0xa1 0xa6 0xa8 0x3f 0xa4 0xd3 0x00 0xd5 0xf0 0xd9 0x22 0xda 0x12 0xdb 0x20 0x8b 0x14 0xaf
	OLED_WR_Byte(0x22, OLED_CMD);
	OLED_WR_Byte(0xda, OLED_CMD);
	OLED_WR_Byte(0x12, OLED_CMD);
	OLED_WR_Byte(0xdb, OLED_CMD);
	OLED_WR_Byte(0x20, OLED_CMD);
	OLED_WR_Byte(0x8b, OLED_CMD);
	OLED_WR_Byte(0x14, OLED_CMD);
	OLED_WR_Byte(0xaf, OLED_CMD);
	#else
	GPIO_InitTypeDef ioC;
	ioC.GPIO_Pin = GPIO_Pin_15;
	ioC.GPIO_Mode = GPIO_Mode_OUT;
	ioC.GPIO_OType = GPIO_OType_PP;
	ioC.GPIO_PuPd = GPIO_PuPd_UP;
	ioC.GPIO_Speed = GPIO_Speed_50MHz;
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOC, ENABLE);
	GPIO_Init(GPIOC, &ioC);

	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOB, ENABLE);
	ioC.GPIO_Pin = GPIO_Pin_15 | GPIO_Pin_14 | GPIO_Pin_13;
	GPIO_Init(GPIOB, &ioC);

	OLED_SDIN = 1;
	OLED_SCLK = 1;
	OLED_RS = 1;

	OLED_RST = 0;
	delayt(0xfff);
	OLED_RST = 1;

	OLED_WR_Byte(0xAE, OLED_CMD); //ï¿½Ø±ï¿½ï¿½ï¿½Ê¾
	OLED_WR_Byte(0xD5, OLED_CMD); //ï¿½ï¿½ï¿½ï¿½Ê±ï¿½Ó·ï¿½Æµï¿½ï¿½ï¿½ï¿½,ï¿½ï¿½Æµï¿½ï¿½
	OLED_WR_Byte(0x80, OLED_CMD); //[3:0],ï¿½ï¿½Æµï¿½ï¿½ï¿½ï¿½;[7:4],ï¿½ï¿½Æµï¿½ï¿½
	OLED_WR_Byte(0xA8, OLED_CMD); //ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Â·ï¿½ï¿½
	OLED_WR_Byte(0X3F, OLED_CMD); //Ä¬ï¿½ï¿½0X3F(1/64)
	OLED_WR_Byte(0xD3, OLED_CMD); //ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Ê¾Æ«ï¿½ï¿½
	OLED_WR_Byte(0X00, OLED_CMD); //Ä¬ï¿½ï¿½Îª0

	OLED_WR_Byte(0x40, OLED_CMD); //ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Ê¾ï¿½ï¿½Ê¼ï¿½ï¿½ [5:0],ï¿½ï¿½ï¿½ï¿½.

	OLED_WR_Byte(0x8D, OLED_CMD); //ï¿½ï¿½É±ï¿½ï¿½ï¿½ï¿½ï¿??
	OLED_WR_Byte(0x14, OLED_CMD); //bit2ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½/ï¿½Ø±ï¿½
	OLED_WR_Byte(0x20, OLED_CMD); //ï¿½ï¿½ï¿½ï¿½ï¿½Ú´ï¿½ï¿½Ö·Ä£ï¿½?
	OLED_WR_Byte(0x02, OLED_CMD); //[1:0],00ï¿½ï¿½ï¿½Ðµï¿½Ö·Ä£Ê½;01ï¿½ï¿½ï¿½Ðµï¿½Ö·Ä£Ê½;10,Ò³ï¿½ï¿½Ö·Ä£Ê½;Ä¬ï¿½ï¿½10;
	OLED_WR_Byte(0xA1, OLED_CMD); //ï¿½ï¿½ï¿½Ø¶ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½,bit0:0,0->0;1,0->127;
	OLED_WR_Byte(0xC0, OLED_CMD); //ï¿½ï¿½ï¿½ï¿½COMÉ¨ï¿½è·½ï¿½ï¿½;bit3:0,ï¿½ï¿½Í¨Ä£Ê½;1,ï¿½Ø¶ï¿½ï¿½ï¿½Ä£Ê½ COM[N-1]->COM0;N:ï¿½ï¿½ï¿½ï¿½Â·ï¿½ï¿½
	OLED_WR_Byte(0xDA, OLED_CMD); //ï¿½ï¿½ï¿½ï¿½COMÓ²ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½
	OLED_WR_Byte(0x12, OLED_CMD); //[5:4]ï¿½ï¿½ï¿½ï¿½

	OLED_WR_Byte(0x81, OLED_CMD); //ï¿½Ô±È¶ï¿½ï¿½ï¿½ï¿½ï¿½
	OLED_WR_Byte(0xEF, OLED_CMD); //1~255;Ä¬ï¿½ï¿½0X7F (ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½,Ô½ï¿½ï¿½Ô½ï¿½ï¿½)
	OLED_WR_Byte(0xD9, OLED_CMD); //ï¿½ï¿½ï¿½ï¿½Ô¤ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿??
	OLED_WR_Byte(0xf1, OLED_CMD); //[3:0],PHASE 1;[7:4],PHASE 2;
	OLED_WR_Byte(0xDB, OLED_CMD); //ï¿½ï¿½ï¿½ï¿½VCOMH ï¿½ï¿½Ñ¹ï¿½ï¿½ï¿½ï¿½
	OLED_WR_Byte(0x30, OLED_CMD); //[6:4] 000,0.65*vcc;001,0.77*vcc;011,0.83*vcc;

	OLED_WR_Byte(0xA4, OLED_CMD); //È«ï¿½ï¿½ï¿½ï¿½Ê¾ï¿½ï¿½ï¿½ï¿½;bit0:1,ï¿½ï¿½ï¿½ï¿½;0,ï¿½Ø±ï¿½;(ï¿½ï¿½ï¿½ï¿½/ï¿½ï¿½ï¿½ï¿½)
	OLED_WR_Byte(0xA6, OLED_CMD); //ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Ê¾ï¿½ï¿½Ê½;bit0:1,ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Ê¾;0,ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Ê¾
	OLED_WR_Byte(0xAF, OLED_CMD); //ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Ê¾
	OLED_Clear();
	#endif
}

void OLED_ADDval(u8 x)
{
    static u8 max = 0;
    u8 i = 0, j = 0;
    if (x > 64)
        return;
    if (max < 128)
    {
        OLED_DrawPoint(max, 63 - x, 1);
        max++;
    }
    else
    {
        for (i = 0; i < 8; i++)
            OLED_GRAM[0][i] = OLED_GRAM[1][i];
        for (i = 1; i < 127; i++)
        {
            for (j = 0; j < 8; j++)
                OLED_GRAM[i][j] = OLED_GRAM[i + 1][j];
        }
        for (j = 0; j < 8; j++)
            OLED_GRAM[127][j] = 0;
        OLED_DrawPoint(127, 63 - x, 1);
    }
}

